In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
raw_data = {'first_name' : ['Jason','Molly','Tina','Jake','Amy'],
           'last_name' : ['Miller','Jacobson','Ali','Milner','Cooze'],
           'age' : [42,52,36,24,73],
           'city' : ['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name','last_name','age','city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [3]:
DataFrame(raw_data,columns=['age','city'])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [16]:
df = DataFrame(raw_data,columns=['first_name','last_name','age','city','debt'])
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [6]:
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [7]:
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [8]:
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
Name: 1, dtype: object

In [9]:
df.iloc[:3]

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami

In [15]:
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [17]:
values = Series(data=['M','F','F'],index = [0,1,2])
df['sex'] = values
df

  first_name last_name  age           city debt  sex
0      Jason    Miller   42  San Francisco  NaN    M
1      Molly  Jacobson   52      Baltimore  NaN    F
2       Tina       Ali   36          Miami  NaN    F
3       Jake    Milner   24        Douglas  NaN  NaN
4        Amy     Cooze   73         Boston  NaN  NaN

In [18]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                  NaN        NaN    NaN      NaN     NaN
sex                     M          F      F      NaN     NaN

In [19]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', nan, 'M'],
       ['Molly', 'Jacobson', 52, 'Baltimore', nan, 'F'],
       ['Tina', 'Ali', 36, 'Miami', nan, 'F'],
       ['Jake', 'Milner', 24, 'Douglas', nan, nan],
       ['Amy', 'Cooze', 73, 'Boston', nan, nan]], dtype=object)

In [21]:
df.to_csv()

',first_name,last_name,age,city,debt,sex\n0,Jason,Miller,42,San Francisco,,M\n1,Molly,Jacobson,52,Baltimore,,F\n2,Tina,Ali,36,Miami,,F\n3,Jake,Milner,24,Douglas,,\n4,Amy,Cooze,73,Boston,,\n'